app/views/movies/index.html.haml

  Include:
  - Movie.all_ratings.each do |rating|
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') ORDER BY release_date