app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in '["PG", "PG-13"]')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') ORDER BY release_date
---
  def index
    if (params[:attr])
      @attr=params[:attr]
      @movies = Movie.order(params[:attr])
    else
      @movies = Movie.all
    end

    if (params[:ratings])
      @ratings = params[:ratings]
      @movies = Movie.where(:rating => params[:ratings].keys)